Autodesk.Revit.DB.Architecture.RailConnectionOption
The connections between rails.
Since:
2013

Autodesk.Revit.DB.Architecture.RailConnectionOption.Weld
Rails will be joined in a manner as close to a miter as possible.

Autodesk.Revit.DB.Architecture.RailConnectionOption.Trim
Rails will be trimmed and cut with a vertical plane.